Revit 2026 API

# FamilyManagerRenameCurrentType Method

---

Rename the current family type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RenameCurrentType(
	string typeName
)
```
```vb
Public Sub RenameCurrentType (
	typeName As String
)
```
```cpp
public:
void RenameCurrentType(
	String^ typeName
)
```
```fsharp
member RenameCurrentType :
        typeName : string -> unit
```

#### Parameters

typeName String
    The new name of the current family type.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"typeName"-is . |
| ArgumentException | Thrown when the input argument-"typeName"-is already in use. |
| InvalidOperationException | Thrown when the family type rename failed. |

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace